# Working with pandas with csv or json files

working with file to work with data frame

In [2]:
import pandas as pd

df =  pd.read_csv("./data/bank.csv")
print(df)

      age            job  marital  education default  balance housing loan  \
0      30     unemployed  married    primary      no     1787      no   no
1      33       services  married  secondary      no     4789     yes  yes
2      35     management   single   tertiary      no     1350     yes   no
3      30     management  married   tertiary      no     1476     yes  yes
4      59    blue-collar  married  secondary      no        0     yes   no
...   ...            ...      ...        ...     ...      ...     ...  ...
4516   33       services  married  secondary      no     -333     yes   no
4517   57  self-employed  married   tertiary     yes    -3313     yes  yes
4518   57     technician  married  secondary      no      295      no   no
4519   28    blue-collar  married  secondary      no     1137      no   no
4520   44   entrepreneur   single   tertiary      no     1136     yes  yes

       contact  day month  duration  campaign  pdays  previous poutcome  y
0     cellular   19   oct        79         1     -1         0  unknown  0
1     cellular   11   may       220         1    339         4  failure  0
2     cellular   16   apr       185         1    330         1  failure  0
3      unknown    3   jun       199         4     -1         0  unknown  0
4      unknown    5   may       226         1     -1         0  unknown  0
...        ...  ...   ...       ...       ...    ...       ...      ... ..
4516  cellular   30   jul       329         5     -1         0  unknown  0
4517   unknown    9   may       153         1     -1         0  unknown  0
4518  cellular   19   aug       151        11     -1         0  unknown  0
4519  cellular    6   feb       129         4    211         3    other  0
4520  cellular    3   apr       345         2    249         7    other  0

[4521 rows x 17 columns]

In [3]:
df  = pd.read_csv("./data/bank.csv")
print(df.to_string)

<bound method DataFrame.to_string of       age            job  marital  education default  balance housing loan  \
0      30     unemployed  married    primary      no     1787      no   no
1      33       services  married  secondary      no     4789     yes  yes
2      35     management   single   tertiary      no     1350     yes   no
3      30     management  married   tertiary      no     1476     yes  yes
4      59    blue-collar  married  secondary      no        0     yes   no
...   ...            ...      ...        ...     ...      ...     ...  ...
4516   33       services  married  secondary      no     -333     yes   no
4517   57  self-employed  married   tertiary     yes    -3313     yes  yes
4518   57     technician  married  secondary      no      295      no   no
4519   28    blue-collar  married  secondary      no     1137      no   no
4520   44   entrepreneur   single   tertiary      no     1136     yes  yes

       contact  day month  duration  campaign  pdays  previous poutcome  y
0     cellular   19   oct        79         1     -1         0  unknown  0
1     cellular   11   may       220         1    339         4  failure  0
2     cellular   16   apr       185         1    330         1  failure  0
3      unknown    3   jun       199         4     -1         0  unknown  0
4      unknown    5   may       226         1     -1         0  unknown  0
...        ...  ...   ...       ...       ...    ...       ...      ... ..
4516  cellular   30   jul       329         5     -1         0  unknown  0
4517   unknown    9   may       153         1     -1         0  unknown  0
4518  cellular   19   aug       151        11     -1         0  unknown  0
4519  cellular    6   feb       129         4    211         3    other  0
4520  cellular    3   apr       345         2    249         7    other  0

[4521 rows x 17 columns]>

In [4]:
print(pd.options.display.max_rows)

60

In [6]:
print(df.head(5))

   age          job  marital  education default  balance housing loan  \
0   30   unemployed  married    primary      no     1787      no   no
1   33     services  married  secondary      no     4789     yes  yes
2   35   management   single   tertiary      no     1350     yes   no
3   30   management  married   tertiary      no     1476     yes  yes
4   59  blue-collar  married  secondary      no        0     yes   no

    contact  day month  duration  campaign  pdays  previous poutcome  y
0  cellular   19   oct        79         1     -1         0  unknown  0
1  cellular   11   may       220         1    339         4  failure  0
2  cellular   16   apr       185         1    330         1  failure  0
3   unknown    3   jun       199         4     -1         0  unknown  0
4   unknown    5   may       226         1     -1         0  unknown  0

In [8]:
print(df.tail())

      age            job  marital  education default  balance housing loan  \
4516   33       services  married  secondary      no     -333     yes   no
4517   57  self-employed  married   tertiary     yes    -3313     yes  yes
4518   57     technician  married  secondary      no      295      no   no
4519   28    blue-collar  married  secondary      no     1137      no   no
4520   44   entrepreneur   single   tertiary      no     1136     yes  yes

       contact  day month  duration  campaign  pdays  previous poutcome  y
4516  cellular   30   jul       329         5     -1         0  unknown  0
4517   unknown    9   may       153         1     -1         0  unknown  0
4518  cellular   19   aug       151        11     -1         0  unknown  0
4519  cellular    6   feb       129         4    211         3    other  0
4520  cellular    3   apr       345         2    249         7    other  0

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        4521 non-null   int64
 1   job        4521 non-null   object
 2   marital    4521 non-null   object
 3   education  4521 non-null   object
 4   default    4521 non-null   object
 5   balance    4521 non-null   int64
 6   housing    4521 non-null   object
 7   loan       4521 non-null   object
 8   contact    4521 non-null   object
 9   day        4521 non-null   int64
 10  month      4521 non-null   object
 11  duration   4521 non-null   int64
 12  campaign   4521 non-null   int64
 13  pdays      4521 non-null   int64
 14  previous   4521 non-null   int64
 15  poutcome   4521 non-null   object
 16  y          4521 non-null   int64
dtypes: int64(8), object(9)
memory usage: 600.6+ KB

In [11]:
df.describe

<bound method NDFrame.describe of       age            job  marital  education default  balance housing loan  \
0      30     unemployed  married    primary      no     1787      no   no
1      33       services  married  secondary      no     4789     yes  yes
2      35     management   single   tertiary      no     1350     yes   no
3      30     management  married   tertiary      no     1476     yes  yes
4      59    blue-collar  married  secondary      no        0     yes   no
...   ...            ...      ...        ...     ...      ...     ...  ...
4516   33       services  married  secondary      no     -333     yes   no
4517   57  self-employed  married   tertiary     yes    -3313     yes  yes
4518   57     technician  married  secondary      no      295      no   no
4519   28    blue-collar  married  secondary      no     1137      no   no
4520   44   entrepreneur   single   tertiary      no     1136     yes  yes

       contact  day month  duration  campaign  pdays  previous poutcome  y
0     cellular   19   oct        79         1     -1         0  unknown  0
1     cellular   11   may       220         1    339         4  failure  0
2     cellular   16   apr       185         1    330         1  failure  0
3      unknown    3   jun       199         4     -1         0  unknown  0
4      unknown    5   may       226         1     -1         0  unknown  0
...        ...  ...   ...       ...       ...    ...       ...      ... ..
4516  cellular   30   jul       329         5     -1         0  unknown  0
4517   unknown    9   may       153         1     -1         0  unknown  0
4518  cellular   19   aug       151        11     -1         0  unknown  0
4519  cellular    6   feb       129         4    211         3    other  0
4520  cellular    3   apr       345         2    249         7    other  0

[4521 rows x 17 columns]>

In [12]:
df.dropna()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,0
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,0
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,0
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,0
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,0
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,0
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,0
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,0
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,0

In [13]:
df["age"].mean()

41.17009511170095

In [14]:
df["age"].median()

39.0

In [18]:
df["age"].mode()

0    34
Name: age, dtype: int64

df.loc[7, 'Duration'] = 45 for small dataset we can replace data one by one

for big dataset it will be turn out to be hectic one.. so we encourage to use python power like 

for x in df.index:
  if df.loc[x, "Duration"] > 120:
    df.loc[x, "Duration"] = 120



Delete rows where "Duration" is higher than 120:

for x in df.index:
  if df.loc[x, "Duration"] > 120:
    df.drop(x, inplace = True)

df.drop_duplicates(inplace = True)  to drop duplicates from the Dataframe

In [19]:
df.corr()

C:\Users\Nithish_Singh\AppData\Local\Temp\ipykernel_17092\1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

,age,balance,day,duration,campaign,pdays,previous,y
age,1.000000,0.083820,-0.017853,-0.002367,-0.005148,-0.008894,-0.003511,0.045092
balance,0.083820,1.000000,-0.008677,-0.015950,-0.009976,0.009437,0.026196,0.017905
day,-0.017853,-0.008677,1.000000,-0.024629,0.160706,-0.094352,-0.059114,-0.011244
duration,-0.002367,-0.015950,-0.024629,1.000000,-0.068382,0.010380,0.018080,0.401118
campaign,-0.005148,-0.009976,0.160706,-0.068382,1.000000,-0.093137,-0.067833,-0.061147
pdays,-0.008894,0.009437,-0.094352,0.010380,-0.093137,1.000000,0.577562,0.104087
previous,-0.003511,0.026196,-0.059114,0.018080,-0.067833,0.577562,1.000000,0.116714
y,0.045092,0.017905,-0.011244,0.401118,-0.061147,0.104087,0.116714,1.000000